app/controllers/songlists_controller.rb

SELECT category FROM "songlists" GROUP BY category
---
  def index
    @songlists = if params[:keyword].to_s!=''
      Songlist.where("label like '%"+params[:keyword]+"%'")
    else
      Songlist
    end

    (@songlists = @songlists.where(:sid=>'0'*(5-params[:sid].to_s.length)+params[:sid].to_s)) if params[:sid].to_s!=''
    (@songlists = @songlists.where(:category=>params[:category])) if params[:category].to_s!=''

    @songlists = @songlists.order(:sid).limit(200)

    categories = Songlist.select(:category).group(:category)